day11/02codeStreamFieldInitialization/codeStream_INIT/rayleigh_taylor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          32;
        startFace       8032;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          32;
        startFace       8064;
    }
    left
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          128;
        startFace       8096;
    }
    right
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          128;
        startFace       8224;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8192;
        startFace       8352;
    }
)

// ************************************************************************* //
